using Microsoft.AspNetCore.Components;

namespace ЗаданиеТестСтажировкаМагнитПриложениеBlazor.Данные
{
    public class ТестЗаполнениеЗаказы : ComponentBase
    {
        public IEnumerable<Заказ> Заказы { get; set; }

        protected override Task OnInitializedAsync()
        {
            ИнициироватьЗаказы();
            return base.OnInitializedAsync();
        }

        public void ИнициироватьЗаказы()
        {
            Заказы = new List<Заказ>
            {
                new Заказ
                {
                    Id = 1,
                    Товар = new ТоварнаяПозиция
                    {
                        Id = 1,
                        Наименование = "Сыр"
                    },
                    ЕдиницыИзмерения = ЕдиницыИзмерения.килограммы,
                    Количество = 350.0F,
                    ДатаЗаказа = new DateOnly(2024, 6, 21),
                    ДатаОтгрузки = new DateOnly(2024, 6, 22),
                    Поставщик = new Контрагент
                    {
                        Id = 1, Наименование = "Рога и Копыта"
                    }
                },
                new Заказ
                {
                    Id = 2,
                    Товар = new ТоварнаяПозиция
                    {
                        Id = 2,
                        Наименование = "Молоко"
                    },
                    ЕдиницыИзмерения = ЕдиницыИзмерения.литры,
                    Количество = 50.25F,
                    ДатаЗаказа = new DateOnly(2024, 6, 27),
                    ДатаОтгрузки = new DateOnly(2024, 6, 29),
                    Поставщик = new Контрагент
                    {
                        Id = 2, Наименование = "Чебурашка и КО"
                    }
                },
                new Заказ
                {
                    Id = 3,
                    Товар = new ТоварнаяПозиция
                    {
                        Id = 3,
                        Наименование = "Упаковка печенья"
                    },
                    ЕдиницыИзмерения = ЕдиницыИзмерения.штуки,
                    Количество = 100,
                    ДатаЗаказа = new DateOnly(2024, 6, 26),
                    ДатаОтгрузки = new DateOnly(2024, 6, 28),
                    Поставщик = new Контрагент
                    {
                        Id = 3, Наименование = "ОАО \"Любятово\""
                    }
                }
            };
        }
    }
}
